{
    "architectures": ["LlamaForCausalLM"],
    "attention_bias": false,
    "attention_dropout": 0.0,
    "bos_token_id": 0,
    "eos_token_id": 0,
    "hidden_act": "silu",
    "hidden_size": 1536,
    "initializer_range": 0.02,
    "intermediate_size": 4096,
    "is_llama_config": true,
    "max_position_embeddings": 2048,
    "model_type": "llama",
    "num_attention_heads": 24,
    "num_hidden_layers": 24,
    "pretraining_tp": 1,
    "rms_norm_eps": 1e-05,
    "rope_interleaved": false,
    "rope_scaling": null,
    "rope_theta": 100000,
    "tie_word_embeddings": false,
    "torch_dtype": "bfloat16",
    "use_cache": true,
    "flash_attn": true
}